---------------------------------------------------------------------
-- Microsoft SQL Server 2012: Основы T-SQL
-- Глава 02 - Запросы к одиночным таблицам
-- Упражнения
-- © Ицик Бен-Ган
---------------------------------------------------------------------

-- 1 
-- Верните заказы, размещенные в июне 2007 года
-- Используемые таблицы: Sales.Orders

-- Ожидаемый результат:
orderid     orderdate               custid      empid
----------- ----------------------- ----------- -----------
10555       2007-06-02 00:00:00.000 71          6
10556       2007-06-03 00:00:00.000 73          2
10557       2007-06-03 00:00:00.000 44          9
10558       2007-06-04 00:00:00.000 4           1
10559       2007-06-05 00:00:00.000 7           6
10560       2007-06-06 00:00:00.000 25          8
10561       2007-06-06 00:00:00.000 24          2
10562       2007-06-09 00:00:00.000 66          1
10563       2007-06-10 00:00:00.000 67          2
10564       2007-06-10 00:00:00.000 65          4
10565       2007-06-11 00:00:00.000 51          8
10566       2007-06-12 00:00:00.000 7           9
10567       2007-06-12 00:00:00.000 37          1
10568       2007-06-13 00:00:00.000 29          3
10569       2007-06-16 00:00:00.000 65          5
10570       2007-06-17 00:00:00.000 51          3
10571       2007-06-17 00:00:00.000 20          8
10572       2007-06-18 00:00:00.000 5           3
10573       2007-06-19 00:00:00.000 3           7
10574       2007-06-19 00:00:00.000 82          4
10575       2007-06-20 00:00:00.000 52          5
10576       2007-06-23 00:00:00.000 80          3
10577       2007-06-23 00:00:00.000 82          9
10578       2007-06-24 00:00:00.000 11          4
10579       2007-06-25 00:00:00.000 45          1
10580       2007-06-26 00:00:00.000 56          4
10581       2007-06-26 00:00:00.000 21          3
10582       2007-06-27 00:00:00.000 6           3
10583       2007-06-30 00:00:00.000 87          2
10584       2007-06-30 00:00:00.000 7           4

(30 row(s) affected)

-- 2
-- Верните заказы, размещенные в последний день месяца
-- Используемые таблицы: Sales.Orders

-- Ожидаемый результат:
orderid     orderdate               custid      empid
----------- ----------------------- ----------- -----------
10269       2006-07-31 00:00:00.000 89          5
10317       2006-09-30 00:00:00.000 48          6
10343       2006-10-31 00:00:00.000 44          4
10399       2006-12-31 00:00:00.000 83          8
10432       2007-01-31 00:00:00.000 75          3
10460       2007-02-28 00:00:00.000 24          8
10461       2007-02-28 00:00:00.000 46          1
10490       2007-03-31 00:00:00.000 35          7
10491       2007-03-31 00:00:00.000 28          8
10522       2007-04-30 00:00:00.000 44          4
10583       2007-06-30 00:00:00.000 87          2
10584       2007-06-30 00:00:00.000 7           4
10616       2007-07-31 00:00:00.000 32          1
10617       2007-07-31 00:00:00.000 32          4
10686       2007-09-30 00:00:00.000 59          2
10687       2007-09-30 00:00:00.000 37          9
10725       2007-10-31 00:00:00.000 21          4
10806       2007-12-31 00:00:00.000 84          3
10807       2007-12-31 00:00:00.000 27          4
10987       2008-03-31 00:00:00.000 19          8
10988       2008-03-31 00:00:00.000 65          3
10989       2008-03-31 00:00:00.000 61          2
11060       2008-04-30 00:00:00.000 27          2
11061       2008-04-30 00:00:00.000 32          4
11062       2008-04-30 00:00:00.000 66          4
11063       2008-04-30 00:00:00.000 37          3

(26 row(s) affected)

-- 3 
-- Верните сотрудников, в фамилиях которых содержится больше одной буквы "о"
-- Используемые таблицы: HR.Employees

-- Ожидаемый результат:
empid       firstname  lastname
----------- ---------- --------------------
9           Зоя        Долгопятова

(1 row(s) affected)

-- 4 
-- Верните заказы, чья общая стоимость (qty*unitprice) превышает 10000
-- отсортируйте результат по общей стоимости
-- Используемые таблицы: Sales.OrderDetails

-- Ожидаемый результат:
orderid     totalvalue
----------- ---------------------
10865       17250.00
11030       16321.90
10981       15810.00
10372       12281.20
10424       11493.20
10817       11490.70
10889       11380.00
10417       11283.20
10897       10835.24
10353       10741.60
10515       10588.50
10479       10495.60
10540       10191.70
10691       10164.80

(14 row(s) affected)

-- 5 
-- Верните три страны, средняя стоимость отправки заказов в которые была самой высокой в 2007 году
-- Используемые таблицы: Sales.Orders

-- Ожидаемый результат:
shipcountry                       avgfreight
--------------------------------- ---------------------
Австрия                           178,3642
Швейцария                         117,1775
Швеция                            105,16

(3 row(s) affected)

-- 6 
-- Вычислите номера строк отдельно для каждого клиента,
-- исходя из даты размещения заказа (используя идентификатор
-- заказа в качестве дополнительного условия)
-- Используемые таблицы: Sales.Orders

-- Ожидаемый результат:
custid      orderdate               orderid     rownum
----------- ----------------------- ----------- --------------------
1           2007-08-25 00:00:00.000 10643       1
1           2007-10-03 00:00:00.000 10692       2
1           2007-10-13 00:00:00.000 10702       3
1           2008-01-15 00:00:00.000 10835       4
1           2008-03-16 00:00:00.000 10952       5
1           2008-04-09 00:00:00.000 11011       6
2           2006-09-18 00:00:00.000 10308       1
2           2007-08-08 00:00:00.000 10625       2
2           2007-11-28 00:00:00.000 10759       3
2           2008-03-04 00:00:00.000 10926       4
...

(830 row(s) affected)

-- 7
-- Определите пол каждого сотрудника, исходя из формы обращения к нему 
-- 'мисс' и 'миссис' означают 'женщина'; 'мистер' означает 'мужчина';
-- 'доктор' означает 'неизвестно'
-- Используемые таблицы: HR.Employees

-- Ожидаемый результат:
empid       firstname  lastname      titleofcourtesy     gender
----------- ---------- ------------- ------------------- ----------
1           Сара       Дэвис         мисс                женщина
2           Дон        Функ          доктор              неизвестно
3           Джуди      Лью           мисс                женщина
4           Иаиль      Пелед         миссис              женщина
5           Свен       Бак           мистер              мужчина
6           Пол        Суурс         мистер              мужчина
7           Рассел     Кинг          мистер              мужчина
8           Мария      Камерон       мисс                женщина
9           Зоя        Долгопятова   мисс                женщина

(9 row(s) affected)

-- 8 (углубленное, по желанию)
-- Верните для каждого клиента его идентификатор и регион.
-- Сортировка должна выполняться по региону, а отметки NULL
-- должны находиться в конце (после «ненулевых» значений).
-- Помните,что по умолчанию язык T-SQL размещает отметки NULL
-- в начале результирующего набора.
-- Используемые таблицы: Sales.Customers

-- Ожидаемый результат:
custid      region
----------- ---------------
55          AK
10          BC
42          BC
45          CA
33          DF
71          ID
78          MT
65          NM
32          OR
...
1           NULL
2           NULL
3           NULL
4           NULL
5           NULL
6           NULL
7           NULL
8           NULL
9           NULL
11          NULL
...

(91 row(s) affected)
